examples/openfoamAI/ControlSimu/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

backgroundMesh
{
    xMin  0;
    xMax  2000;
    
    yMin  0;
    yMax  200;
    
    zMin    0;
    zMax   1000; 
    
    xCells  50;
    yCells  40;
    zCells  40;
}

vertices
(
    (0 0 0)
    (2000 0 0)
    (2000 200 0)
    (0 200 0)
    
    (0 0 1000)
    (2000 0 1000)
    (2000 200 1000)
    (0 200 1000)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 20 60) simpleGrading (1 1 1)
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
